name: "m3e_base"
backend: "python"
max_batch_size: 16
input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ 768 ]
  }
]
instance_group [
{
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
}
]

dynamic_batching {
   preferred_batch_size: [ 4, 8, 16]
   max_queue_delay_microseconds: 1000
}
