name: "opus_mt_en_zh"
backend: "python"
max_batch_size: 4
input [
  {
    name: "data"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "data_type"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
instance_group [
{
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
}
]

dynamic_batching {
   preferred_batch_size: [2, 4]
   max_queue_delay_microseconds: 1000
}
